{
  "model_type": "mixtral",
  "architectures": ["MixtralForCausalLM"],
  "hidden_size": 7168,
  "intermediate_size": 2048,
  "num_attention_heads": 64,
  "num_key_value_heads": 64,
  "num_hidden_layers": 61,
  "num_local_experts": 384,
  "num_experts_per_tok": 8,
  "vocab_size": 163840,
  "max_position_embeddings": 131072,
  "_name_or_path": "kimi-k2"
}
