{
  "architectures": [
    "MixtralForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "max_position_embeddings": 40960,
  "model_type": "mixtral",
  "num_attention_heads": 64,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 94,
  "num_key_value_heads": 4,
  "num_local_experts": 128,
  "output_router_logits": false,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000,
  "router_aux_loss_coef": 0.001,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.43.0",
  "use_cache": true,
  "vocab_size": 151936
}
